#!/usr/bin/env python
# -*- coding:utf8 -*-
import sys
import urllib2
import re
import datetime

'''
#新浪的实时接口,分为
# 获取单只个股 http://hq.sinajs.cn/list=sh601006
var hq_str_sh601006="大秦铁路, 27.55, 27.25, 26.91, 27.55, 26.20, 26.91, 26.92, 
22114263, 589824680, 4695, 26.91, 57590, 26.90, 14700, 26.89, 14300,
26.88, 15100, 26.87, 3100, 26.92, 8900, 26.93, 14230, 26.94, 25150, 26.95, 15220, 26.96, 2008-01-11, 15:05:32";
这个字符串由许多数据拼接在一起，不同含义的数据用逗号隔开了，按照程序员的思路，顺序号从0开始。
0：”大秦铁路”，股票名字；
1：”27.55″，今日开盘价；
2：”27.25″，昨日收盘价；
3：”26.91″，当前价格；
4：”27.55″，今日最高价；
5：”26.20″，今日最低价；
6：”26.91″，竞买价，即“买一”报价；
7：”26.92″，竞卖价，即“卖一”报价；
8：”22114263″，成交的股票数，由于股票交易以一百股为基本单位，所以在使用时，通常把该值除以一百；
9：”589824680″，成交金额，单位为“元”，为了一目了然，通常以“万元”为成交金额的单位，所以通常把该值除以一万；
10：”4695″，“买一”申请4695股，即47手；
11：”26.91″，“买一”报价；
12：”57590″，“买二”
13：”26.90″，“买二”
14：”14700″，“买三”
15：”26.89″，“买三”
16：”14300″，“买四”
17：”26.88″，“买四”
18：”15100″，“买五”
19：”26.87″，“买五”
20：”3100″，“卖一”申报3100股，即31手；
21：”26.92″，“卖一”报价
(22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
30：”2008-01-11″，日期；
31：”15:05:32″，时间；

# 获取多只个股 http://hq.sinajs.cn/list=sh601003,sh601001
# 获取指数 http://hq.sinajs.cn/list=s_sh000001

# 获取简要信息：		http://qt.gtimg.cn/q=s_sz002818
v_s_sz002818="51~富森美~002818~72.50~6.59~10.00~203451~144984~~319.00";
0: 不明
1: 名字
2: 代码
3: 现价
4: 涨跌
5: 涨跌%
6: 成交量（手）
7: 成交额（万）
8: /
9: 总市值
# 获取盘口分析：		http://qt.gtimg.cn/q=s_pksz002818
002818="-1.0~-1.0~-1.0~-1.0";
0: 买盘大单
1: 买盘小单
2: 卖盘大单
3: 卖盘小单
# 获取实时资金流向：	http://qt.gtimg.cn/q=ff_sz002818
v_ff_sz002818="sz002818~61516.50~5871.35~55645.15~38.38~83467.00~139111.84~-55644.84~-38.38~144983.50~62989.0~5911.98~富森美~
20161121~20161118^1089.29^40.63~20161117^174.89^0.00~20161116^155.70^0.00~20161115^52.62^0.00";
 0: 代码
 1: 主力流入
 2: 主力流出
 3: 主力净流入
 4: 主力净流入/资金流入流出总和
 5: 散户流入
 6: 散户流出
 7: 散户净流入
 8: 散户净流入/资金流入流出总和
 9: 资金流入流出总和1+2+5+6
10: 不明
11: 不明
12: 名字
13: 日期
# 获取最新行情，访问数据接口：	http://qt.gtimg.cn/q=sz002818
v_sz002818="51~富森美~002818~72.50~65.91~72.46~203451~103832~99620~72.50~6229~72.49~1066~72.48~29~72.47~14~72.46~35~0.00~0~0.00~0~0.00~0~0.00~0~0.00~0~15:00:04
/72.50/356/S/2581000/15070|14:57:00/72.50/5/S/36250/14971|14:56:57/72.50/2/S/14500/14968|14:56:55/72.50/7/S/50750/14963|14:56:51/72.50/13/S/94250/14960|14:56:45
/72.50/9/S/65250/14952~20161121150133~6.59~10.00~72.50~69.46~72.50/203095/1447255013~203451~144984~46.24~70.47~~72.50~69.46~4.61~31.90~319.00~10.57~72.50~59.32~411.68";
 0: 不明
 1: 名字
 2: 代码
 3: 现价
 4: 昨收
 5: 今开
 6: 成交量（手）
 7: 外盘
 8: 内盘
 9: 买一
10: 买一量（手）
11-18: 买二 - 买五
19: 卖一
20: 卖一量
21-28: 卖二 - 卖五
29: 最近逐笔成交
30: 时间
31: 涨跌
32: 涨跌%
33: 最高
34: 最低
35: 价格/成交量（手）/成交额
36: 成交量（手）
37: 成交额（万）
38: 换手率
39: 市盈率
40: /
41: 最高
42: 最低
43: 振幅
44: 流通市值
45: 总市值
46: 市净率
47: 涨停价
48: 跌停价
'''

url = "http://hq.sinajs.cn/list="

def get_rt_data(code):
	urllink = url + code
	stockData = None
	try:
		#print urllink
		req = urllib2.Request(urllink)
		stockData = urllib2.urlopen(req, timeout=2).read()
	except:
		print "URL timeout"
	else:
		stockObj = stockData.split(',')
	return stockData

#Main 开始
code = 'sz002855'
stockData = get_rt_data(code)
print stockData


